artifact/cta/2025/2025-EMS-2-HeatStroke_v351-request.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.nemsis.org/"><soapenv:Header/><soapenv:Body><ws:SubmitDataRequest><ws:username>fusion_quant2</ws:username><ws:password>Addyson123456!</ws:password><ws:organization>FusionEMSQuantum</ws:organization><ws:requestType>SubmitData</ws:requestType><ws:submitPayload><ws:payloadOfXmlElement><EMSDataSet xmlns="http://www.nemsis.org" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.nemsis.org https://nemsis.org/media/nemsis_v3/3.5.1.250403CP1/XSDs/NEMSIS_XSDs/EMSDataSet_v3.xsd"><Header><DemographicGroup><dAgency.01>120495</dAgency.01><dAgency.02>351-T0495</dAgency.02><dAgency.04>12</dAgency.04></DemographicGroup><PatientCareReport UUID="397f7035-b4b5-58ae-92ae-053460588876"><eRecord><eRecord.01>FEMSQ-2025-EMS-00002</eRecord.01><eRecord.SoftwareApplicationGroup><eRecord.02>Adaptix</eRecord.02><eRecord.03>Adaptix ePCR</eRecord.03><eRecord.04>1.0.0</eRecord.04></eRecord.SoftwareApplicationGroup></eRecord><eResponse><eResponse.AgencyGroup><eResponse.01>351-T0495</eResponse.01><eResponse.02>351-T0495</eResponse.02></eResponse.AgencyGroup><eResponse.03>351-241134-005</eResponse.03><eResponse.04>351-241134-005-1</eResponse.04><eResponse.ServiceGroup><eResponse.05>2205001</eResponse.05></eResponse.ServiceGroup><eResponse.07>2207015</eResponse.07><eResponse.08>2208013</eResponse.08><eResponse.09>2209011</eResponse.09><eResponse.10>2210017</eResponse.10><eResponse.11 NV="7701001" xsi:nil="true" /><eResponse.12>2212015</eResponse.12><eResponse.13>1R653</eResponse.13><eResponse.14>Medic 60</eResponse.14><eResponse.16>Laurel Hill Station</eResponse.16><eResponse.17>30.968,-86.458</eResponse.17><eResponse.18>16REV51762618</eResponse.18><eResponse.19>248296.1</eResponse.19><eResponse.20>248302.1</eResponse.20><eResponse.22>248308.2</eResponse.22><eResponse.23>2223001</eResponse.23><eResponse.24>2224021</eResponse.24></eResponse><eDispatch><eDispatch.01>2301077</eDispatch.01><eDispatch.02>2302007</eDispatch.02><eDispatch.03>31C01</eDispatch.03><eDispatch.04>Okaloosa 911</eDispatch.04><eDispatch.05>2305003</eDispatch.05></eDispatch><eCrew><eCrew.CrewGroup><eCrew.01>EMT470248</eCrew.01><eCrew.02>9925005</eCrew.02><eCrew.03>2403001</eCrew.03><eCrew.03>2403003</eCrew.03><eCrew.03>2403007</eCrew.03></eCrew.CrewGroup><eCrew.CrewGroup><eCrew.01>PMD668912</eCrew.01><eCrew.02>9925007</eCrew.02><eCrew.03>2403011</eCrew.03><eCrew.03>2403013</eCrew.03></eCrew.CrewGroup></eCrew><eTimes><eTimes.01>2024-11-03T15:52:21-05:00</eTimes.01><eTimes.02>2024-11-03T15:52:54-05:00</eTimes.02><eTimes.03>2024-11-03T15:53:48-05:00</eTimes.03><eTimes.04>2024-11-03T15:54:07-05:00</eTimes.04><eTimes.05>2024-11-03T15:55:09-05:00</eTimes.05><eTimes.06>2024-11-03T16:04:26-05:00</eTimes.06><eTimes.07>2024-11-03T16:05:12-05:00</eTimes.07><eTimes.08>2024-11-03T16:13:36-05:00</eTimes.08><eTimes.09>2024-11-03T16:21:20-05:00</eTimes.09><eTimes.11 NV="7701001" xsi:nil="true" /><eTimes.12 NV="7701001" xsi:nil="true" /><eTimes.13>2024-11-03T16:21:49-05:00</eTimes.13><eTimes.15>2024-11-03T16:31:40-05:00</eTimes.15><eTimes.16>2024-11-03T16:45:37-05:00</eTimes.16></eTimes><ePatient><ePatient.01>42GV6F</ePatient.01><ePatient.PatientNameGroup><ePatient.02>Hudson</ePatient.02><ePatient.03>Brook</ePatient.03><ePatient.04>Hackett</ePatient.04></ePatient.PatientNameGroup><ePatient.05>W1088 Voss Rd</ePatient.05><ePatient.06>2831515</ePatient.06><ePatient.07>55015</ePatient.07><ePatient.08>55</ePatient.08><ePatient.09>54110</ePatient.09><ePatient.10>US</ePatient.10><ePatient.11>55015020200</ePatient.11><ePatient.12>741246871</ePatient.12><ePatient.13 NV="7701003" xsi:nil="true" /><ePatient.14>2514011</ePatient.14><ePatient.AgeGroup><ePatient.15>72</ePatient.15><ePatient.16>2516009</ePatient.16></ePatient.AgeGroup><ePatient.17>1952-04-19</ePatient.17><ePatient.18 PhoneNumberType="9913003">920-756-2817</ePatient.18><ePatient.25>9919003</ePatient.25></ePatient><ePayment><ePayment.01>2601005</ePayment.01><ePayment.08>2608003</ePayment.08><ePayment.InsuranceGroup><ePayment.09>MC</ePayment.09><ePayment.10>2601001</ePayment.10><ePayment.11>2611003</ePayment.11><ePayment.12>7500 Security Boulevard</ePayment.12><ePayment.13>Baltimore</ePayment.13><ePayment.14>24</ePayment.14><ePayment.15>21244</ePayment.15><ePayment.16>US</ePayment.16><ePayment.18>38271</ePayment.18><ePayment.19>Hudson</ePayment.19><ePayment.20>Brook</ePayment.20><ePayment.21>Hackett</ePayment.21><ePayment.22>2622001</ePayment.22><ePayment.59 PhoneNumberType="9913009">800-633-4227</ePayment.59><ePayment.59 PhoneNumberType="9913001">800-633-4229</ePayment.59><ePayment.60>1952-04-19</ePayment.60></ePayment.InsuranceGroup><ePayment.40>2640001</ePayment.40><ePayment.41>2641001</ePayment.41><ePayment.41>2641003</ePayment.41><ePayment.41>2641005</ePayment.41><ePayment.49>9923003</ePayment.49><ePayment.50>2650003</ePayment.50><ePayment.51>E86.0</ePayment.51><ePayment.51>T67</ePayment.51><ePayment.57>MB</ePayment.57></ePayment><eScene><eScene.01>9923003</eScene.01><eScene.ResponderGroup><eScene.02>Survival Flight, Inc.</eScene.02><eScene.03>9511</eScene.03><eScene.04>2704013</eScene.04><eScene.25>2725001</eScene.25></eScene.ResponderGroup><eScene.06>2707005</eScene.06><eScene.07>9923001</eScene.07><eScene.08 NV="7701001" xsi:nil="true" /><eScene.09>Y92.838</eScene.09><eScene.11>30.992,-86.401</eScene.11><eScene.12>16REV57192888</eScene.12><eScene.13>Holiday Hills Music Park</eScene.13><eScene.15>4191 Bluegrass Parkway</eScene.15><eScene.17>2404890</eScene.17><eScene.18>12</eScene.18><eScene.19>32567</eScene.19><eScene.21>12091</eScene.21><eScene.22>US</eScene.22><eScene.23>12091020200</eScene.23></eScene><eSituation><eSituation.01 PN="8801029">2024-11-03T14:45:00-05:00</eSituation.01><eSituation.02>9922003</eSituation.02><eSituation.PatientComplaintGroup><eSituation.03>2803001</eSituation.03><eSituation.04>Barely responsive</eSituation.04><eSituation.05>30</eSituation.05><eSituation.06>2806003</eSituation.06></eSituation.PatientComplaintGroup><eSituation.PatientComplaintGroup><eSituation.03>2803005</eSituation.03><eSituation.04>Shallow breathing</eSituation.04><eSituation.05>10</eSituation.05><eSituation.06>2806003</eSituation.06></eSituation.PatientComplaintGroup><eSituation.07>2807011</eSituation.07><eSituation.08>2808011</eSituation.08><eSituation.09>R41.82</eSituation.09><eSituation.10>R06.89</eSituation.10><eSituation.10>R50.9</eSituation.10><eSituation.10>R53.81</eSituation.10><eSituation.11>T67</eSituation.11><eSituation.12>E86.0</eSituation.12><eSituation.13>2813003</eSituation.13><eSituation.WorkRelatedGroup><eSituation.14>9922001</eSituation.14></eSituation.WorkRelatedGroup><eSituation.17>Y93.82</eSituation.17><eSituation.18 PN="8801029">2024-11-03T12:00:00-05:00</eSituation.18><eSituation.20 NV="7701001" xsi:nil="true" /></eSituation><eInjury><eInjury.01 NV="7701003" xsi:nil="true" /><eInjury.02 NV="7701003" xsi:nil="true" /><eInjury.03 NV="7701003" xsi:nil="true" /><eInjury.04 NV="7701003" xsi:nil="true" /></eInjury><eArrest><eArrest.01>3001001</eArrest.01><eArrest.02 NV="7701001" xsi:nil="true" /><eArrest.03 NV="7701001" xsi:nil="true" /><eArrest.04 NV="7701001" xsi:nil="true" /><eArrest.07 NV="7701001" xsi:nil="true" /><eArrest.09 NV="7701001" xsi:nil="true" /><eArrest.11 NV="7701001" xsi:nil="true" /><eArrest.12 NV="7701001" xsi:nil="true" /><eArrest.14 NV="7701001" xsi:nil="true" /><eArrest.16 NV="7701001" xsi:nil="true" /><eArrest.17 NV="7701001" xsi:nil="true" /><eArrest.18 NV="7701001" xsi:nil="true" /><eArrest.20 NV="7701001" xsi:nil="true" /><eArrest.21 NV="7701001" xsi:nil="true" /><eArrest.22 NV="7701001" xsi:nil="true" /></eArrest><eHistory><eHistory.01>3101009</eHistory.01><eHistory.05>3105005</eHistory.05><eHistory.06 PN="8801013" xsi:nil="true" /><eHistory.07>160244002</eHistory.07><eHistory.08>04130ZR</eHistory.08><eHistory.08>E11.8</eHistory.08><eHistory.08>F17.299</eHistory.08><eHistory.08>I10</eHistory.08><eHistory.08>U07.0</eHistory.08><eHistory.09>3109003</eHistory.09><eHistory.CurrentMedsGroup><eHistory.12>2679059</eHistory.12><eHistory.13>12.5</eHistory.13><eHistory.14>3114029</eHistory.14><eHistory.15>9927035</eHistory.15><eHistory.20>3120019</eHistory.20></eHistory.CurrentMedsGroup><eHistory.CurrentMedsGroup><eHistory.12>324042</eHistory.12><eHistory.13>100</eHistory.13><eHistory.14>3114029</eHistory.14><eHistory.15>9927035</eHistory.15><eHistory.20>3120019</eHistory.20></eHistory.CurrentMedsGroup><eHistory.16>9923001</eHistory.16><eHistory.17 PN="8801015" xsi:nil="true" /><eHistory.19>2024-11-03T12:30:00-05:00</eHistory.19></eHistory><eNarrative><eNarrative.01>Pt was attending outdoor music festival and gradually began experiencing heatstroke and dehydration. He has hx of diabetes and hypertension, and he is on a diuretic hypertension medication. Last intake of water was around 12:30pm. Pt has only been drinking soda since then. Due to remote location and severity of symptoms, air ambulance was dispatched for transport.</eNarrative.01></eNarrative><eVitals><eVitals.VitalGroup><eVitals.01>2024-11-03T16:05:46-05:00</eVitals.01><eVitals.02>9923001</eVitals.02><eVitals.CardiacRhythmGroup><eVitals.03 NV="7701003" xsi:nil="true" /><eVitals.04 NV="7701003" xsi:nil="true" /><eVitals.05 NV="7701003" xsi:nil="true" /></eVitals.CardiacRhythmGroup><eVitals.BloodPressureGroup><eVitals.06>92</eVitals.06><eVitals.07>51</eVitals.07><eVitals.08>3308005</eVitals.08></eVitals.BloodPressureGroup><eVitals.HeartRateGroup><eVitals.10>120</eVitals.10><eVitals.11>3311007</eVitals.11></eVitals.HeartRateGroup><eVitals.12>92</eVitals.12><eVitals.13>3313003</eVitals.13><eVitals.14>22</eVitals.14><eVitals.15>3315011</eVitals.15><eVitals.16 ETCO2Type="3340001">34</eVitals.16><eVitals.17>4</eVitals.17><eVitals.18>High</eVitals.18><eVitals.GlasgowScoreGroup><eVitals.19>4</eVitals.19><eVitals.20>4</eVitals.20><eVitals.21>6</eVitals.21><eVitals.22>3322003</eVitals.22><eVitals.23>14</eVitals.23></eVitals.GlasgowScoreGroup><eVitals.TemperatureGroup><eVitals.24>40.2</eVitals.24><eVitals.25>3325011</eVitals.25></eVitals.TemperatureGroup><eVitals.26>3326003</eVitals.26><eVitals.PainScaleGroup><eVitals.27 NV="7701003" xsi:nil="true" /></eVitals.PainScaleGroup><eVitals.StrokeScaleGroup><eVitals.29>3329001</eVitals.29><eVitals.30>3330027</eVitals.30><eVitals.34>0</eVitals.34></eVitals.StrokeScaleGroup><eVitals.31>3331005</eVitals.31></eVitals.VitalGroup><eVitals.VitalGroup><eVitals.01>2024-11-03T16:11:39-05:00</eVitals.01><eVitals.02>9923001</eVitals.02><eVitals.CardiacRhythmGroup><eVitals.03 NV="7701003" xsi:nil="true" /><eVitals.04 NV="7701003" xsi:nil="true" /><eVitals.05 NV="7701003" xsi:nil="true" /></eVitals.CardiacRhythmGroup><eVitals.BloodPressureGroup><eVitals.06>100</eVitals.06><eVitals.07>59</eVitals.07><eVitals.08>3308005</eVitals.08></eVitals.BloodPressureGroup><eVitals.HeartRateGroup><eVitals.10>97</eVitals.10><eVitals.11>3311007</eVitals.11></eVitals.HeartRateGroup><eVitals.12>93</eVitals.12><eVitals.13>3313003</eVitals.13><eVitals.14>16</eVitals.14><eVitals.15>3315011</eVitals.15><eVitals.16 ETCO2Type="3340001">37</eVitals.16><eVitals.18>528</eVitals.18><eVitals.GlasgowScoreGroup><eVitals.19>4</eVitals.19><eVitals.20>5</eVitals.20><eVitals.21>6</eVitals.21><eVitals.22>3322003</eVitals.22><eVitals.23>15</eVitals.23></eVitals.GlasgowScoreGroup><eVitals.TemperatureGroup><eVitals.24>38.6</eVitals.24><eVitals.25>3325011</eVitals.25></eVitals.TemperatureGroup><eVitals.26>3326001</eVitals.26><eVitals.PainScaleGroup><eVitals.27 NV="7701003" xsi:nil="true" /></eVitals.PainScaleGroup><eVitals.StrokeScaleGroup><eVitals.29 NV="7701003" xsi:nil="true" /><eVitals.30 NV="7701003" xsi:nil="true" /></eVitals.StrokeScaleGroup><eVitals.31 NV="7701003" xsi:nil="true" /></eVitals.VitalGroup></eVitals><eExam><eExam.01>113</eExam.01><eExam.AssessmentGroup><eExam.03>2024-11-03T16:06:19-05:00</eExam.03><eExam.04>3504009</eExam.04><eExam.04>3504013</eExam.04><eExam.05>3505033</eExam.05><eExam.06>3506035</eExam.06><eExam.07>3507029</eExam.07><eExam.09>3509009</eExam.09><eExam.AbdomenGroup><eExam.10>3510001</eExam.10><eExam.11>3511037</eExam.11></eExam.AbdomenGroup><eExam.12>3512037</eExam.12><eExam.SpineGroup><eExam.13>3513001</eExam.13><eExam.14>3514029</eExam.14></eExam.SpineGroup><eExam.ExtremityGroup><eExam.16>3516049</eExam.16></eExam.ExtremityGroup><eExam.EyeGroup><eExam.17>3517001</eExam.17><eExam.18>3518047</eExam.18></eExam.EyeGroup><eExam.EyeGroup><eExam.17>3517005</eExam.17><eExam.18>3518019</eExam.18></eExam.EyeGroup><eExam.LungGroup><eExam.22>3522005</eExam.22><eExam.23>3523003</eExam.23></eExam.LungGroup><eExam.ChestGroup><eExam.24>3524009</eExam.24><eExam.25>3525029</eExam.25></eExam.ChestGroup><eExam.19>3519003</eExam.19><eExam.19>3519033</eExam.19><eExam.20>3520029</eExam.20></eExam.AssessmentGroup></eExam><eProtocols><eProtocols.ProtocolGroup><eProtocols.01>9914029</eProtocols.01><eProtocols.02>3602003</eProtocols.02></eProtocols.ProtocolGroup><eProtocols.ProtocolGroup><eProtocols.01>9914067</eProtocols.01><eProtocols.02>3602001</eProtocols.02></eProtocols.ProtocolGroup><eProtocols.ProtocolGroup><eProtocols.01>9914121</eProtocols.01><eProtocols.02>3602001</eProtocols.02></eProtocols.ProtocolGroup></eProtocols><eMedications><eMedications.MedicationGroup><eMedications.01>2024-11-03T16:09:26-05:00</eMedications.01><eMedications.02>9923001</eMedications.02><eMedications.03 CodeType="9924003">313002</eMedications.03><eMedications.04>9927023</eMedications.04><eMedications.DosageGroup><eMedications.05>2</eMedications.05><eMedications.06>3706009</eMedications.06></eMedications.DosageGroup><eMedications.07>9916001</eMedications.07><eMedications.08>3708031</eMedications.08><eMedications.09>PMD668912</eMedications.09><eMedications.10>9905007</eMedications.10><eMedications.11>9918005</eMedications.11></eMedications.MedicationGroup><eMedications.MedicationGroup><eMedications.01>2024-11-03T16:10:10-05:00</eMedications.01><eMedications.02>9923001</eMedications.02><eMedications.03 CodeType="9924003">7806</eMedications.03><eMedications.04>9927025</eMedications.04><eMedications.DosageGroup><eMedications.05>5</eMedications.05><eMedications.06>3706035</eMedications.06></eMedications.DosageGroup><eMedications.07>9916003</eMedications.07><eMedications.08>3708031</eMedications.08><eMedications.09>EMT470248</eMedications.09><eMedications.10>9905005</eMedications.10><eMedications.11>9918005</eMedications.11></eMedications.MedicationGroup></eMedications><eProcedures><eProcedures.ProcedureGroup><eProcedures.01>2024-11-03T16:07:31-05:00</eProcedures.01><eProcedures.02>9923001</eProcedures.02><eProcedures.03>431774007</eProcedures.03><eProcedures.05>1</eProcedures.05><eProcedures.06>9923003</eProcedures.06><eProcedures.07>3907033</eProcedures.07><eProcedures.08>9916001</eProcedures.08><eProcedures.09>EMT470248</eProcedures.09><eProcedures.10>9905005</eProcedures.10><eProcedures.11>9918005</eProcedures.11></eProcedures.ProcedureGroup><eProcedures.ProcedureGroup><eProcedures.01>2024-11-03T16:08:58-05:00</eProcedures.01><eProcedures.02>9923001</eProcedures.02><eProcedures.03>392230005</eProcedures.03><eProcedures.05>2</eProcedures.05><eProcedures.06>9923003</eProcedures.06><eProcedures.07>3907033</eProcedures.07><eProcedures.08>9916003</eProcedures.08><eProcedures.09>PMD668912</eProcedures.09><eProcedures.10>9905007</eProcedures.10><eProcedures.11>9918005</eProcedures.11><eProcedures.13>3913017</eProcedures.13></eProcedures.ProcedureGroup></eProcedures><eDisposition><eDisposition.DestinationGroup><eDisposition.01>Survival Flight, Inc.</eDisposition.01><eDisposition.02>9511</eDisposition.02><eDisposition.05 NV="7701003" xsi:nil="true" /><eDisposition.06 NV="7701003" xsi:nil="true" /><eDisposition.07 NV="7701003" xsi:nil="true" /></eDisposition.DestinationGroup><eDisposition.11 NV="7701001" xsi:nil="true" /><eDisposition.IncidentDispositionGroup><eDisposition.27>4227001</eDisposition.27><eDisposition.28>4228001</eDisposition.28><eDisposition.29>4229003</eDisposition.29><eDisposition.30>4230005</eDisposition.30></eDisposition.IncidentDispositionGroup><eDisposition.16 NV="7701001" xsi:nil="true" /><eDisposition.17 NV="7701001" xsi:nil="true" /><eDisposition.18 NV="7701001" xsi:nil="true" /><eDisposition.19>4219003</eDisposition.19><eDisposition.20>4220011</eDisposition.20><eDisposition.21>4221015</eDisposition.21><eDisposition.22 NV="7701001" xsi:nil="true" /><eDisposition.23 NV="7701001" xsi:nil="true" /><eDisposition.HospitalTeamActivationGroup><eDisposition.24>4224001</eDisposition.24><eDisposition.25 NV="7701001" xsi:nil="true" /></eDisposition.HospitalTeamActivationGroup><eDisposition.32>4232005</eDisposition.32></eDisposition><eOutcome><eOutcome.01 NV="7701003" xsi:nil="true" /><eOutcome.02 NV="7701003" xsi:nil="true" /><eOutcome.EmergencyDepartmentProceduresGroup><eOutcome.09 NV="7701003" xsi:nil="true" /><eOutcome.19 NV="7701003" xsi:nil="true" /></eOutcome.EmergencyDepartmentProceduresGroup><eOutcome.10 NV="7701003" xsi:nil="true" /><eOutcome.11 NV="7701003" xsi:nil="true" /><eOutcome.HospitalProceduresGroup><eOutcome.12 NV="7701003" xsi:nil="true" /><eOutcome.20 NV="7701003" xsi:nil="true" /></eOutcome.HospitalProceduresGroup><eOutcome.13 NV="7701003" xsi:nil="true" /><eOutcome.16 NV="7701003" xsi:nil="true" /><eOutcome.18 NV="7701003" xsi:nil="true" /></eOutcome><eOther><eOther.01>9923001</eOther.01><eOther.08>PMD668912</eOther.08></eOther></PatientCareReport></Header></EMSDataSet></ws:payloadOfXmlElement></ws:submitPayload><ws:requestDataSchema>61</ws:requestDataSchema><ws:schemaVersion>3.5.1</ws:schemaVersion><ws:additionalInfo>2025-EMS-2-HeatStroke_v351</ws:additionalInfo></ws:SubmitDataRequest></soapenv:Body></soapenv:Envelope>